reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Venom"], ["url", "venom.com"], ["content", "NOT SPIDERMAN"], ["sub_id", 3], ["author_id", 9], ["created_at", "2018-11-21 00:30:49.515832"], ["updated_at", "2018-11-21 00:30:49.515832"]]

  def update
    @post = Post.find(params[:id])

    if @post && @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "BETTER SPIDERMAN"], ["updated_at", "2018-11-21 00:35:18.950930"], ["id", 5]]

  def require_author!
    post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]