reddit_on_rails/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "SuperSmachBros"], ["description", "Smesh"], ["user_id", 2], ["created_at", "2018-11-20 23:00:32.123598"], ["updated_at", "2018-11-20 23:00:32.123598"]]