reddit_on_rails/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <br>
  <% Sub.all.each do |sub| %>