reddit_on_rails/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 3]]
---
  <!-- would have to add all the crossposts here -->
  <% @sub.posts.each do |post| %>